better-robotics/workbench/firmware/esp32_robot_idf/main/fw_info.c
#include "fw_info.h"

#include <stdio.h>

#include "sdkconfig.h"
#include "esp_app_desc.h"
#include "esp_idf_version.h"
#include "esp_log.h"

#include "camera.h"
#include "encoders.h"
#include "flash.h"
#include "fs_svc.h"
#include "led.h"
#include "pyvm.h"
#include "motors.h"
#include "rgb.h"
#include "servo.h"
#include "ws2812.h"

static const char *TAG = "fw_info";

// Three identifiers reported to the dashboard:
//   chip    — IDF target. Binary-compat constraint; what esptool checks.
//   board   — hardware variant. Pin-map constraint; drives the visual
//             pin editor and the dashboard's board-aware UI.
//   variant — board + feature toggle. Disambiguates the OTA bundle url;
//             currently always equal to board (no per-board feature
//             toggles left).
#if CONFIG_IDF_TARGET_ESP32
#  define BR_CHIP_STR "esp32"
#elif CONFIG_IDF_TARGET_ESP32S3
#  define BR_CHIP_STR "esp32s3"
#elif CONFIG_IDF_TARGET_ESP32C3
#  define BR_CHIP_STR "esp32c3"
#else
#  error "fw_info: unknown IDF target"
#endif

#if CONFIG_BR_BOARD_AITHINKER_CAM
#  define BR_BOARD_STR   "aithinker_cam"
#  define BR_VARIANT_STR "aithinker_cam"
#elif CONFIG_BR_BOARD_DEVKIT
#  define BR_BOARD_STR   "devkit"
#  define BR_VARIANT_STR "devkit"
#elif CONFIG_BR_BOARD_S3_CAM
#  define BR_BOARD_STR   "s3_cam"
#  define BR_VARIANT_STR "s3_cam"
#elif CONFIG_BR_BOARD_C3_SUPERMINI
#  define BR_BOARD_STR   "c3_supermini"
#  define BR_VARIANT_STR "c3_supermini"
#else
#  error "fw_info: no BR_BOARD_* defined"
#endif

// Headroom for the fully-loaded board (motors + rgb + servo + encoders +
// camera + snapshot + fs + python). Kept lean on purpose: fw_info is read
// over BLE in one shot, and an oversized payload fails that read (which drops
// the whole capability list). Don't pile large fields in here — the flash map
// lives client-side (partitions.csv is fixed), not in this string.
#define FW_INFO_BUF_SIZE 1024
static char s_buf[FW_INFO_BUF_SIZE];

void fw_info_init(const pin_config_t *pins) {
    int o = 0;
    // esp_app_desc is populated by IDF from `git describe --always`
    // (with `-dirty` suffix on uncommitted changes) at every build,
    // so local flashes report an accurate SHA without a CI stamp step.
    const char *version = esp_app_get_description()->version;
    o += snprintf(s_buf + o, FW_INFO_BUF_SIZE - o,
        "{\"type\":\"esp32\","                  // hardware-class id, stable across chip families
        "\"chip\":\"" BR_CHIP_STR "\","         // esptool-visible identity (binary-compat)
        "\"board\":\"" BR_BOARD_STR "\","       // pin-map identity (UI editor)
        "\"url\":\"firmware/bins/" BR_VARIANT_STR "/firmware.bin\","
        "\"version\":\"%s\",\"caps\":[", version);

    bool first = true;
    if (led_enabled()) {
        o += snprintf(s_buf + o, FW_INFO_BUF_SIZE - o,
            "%s{\"name\":\"led\",\"type\":\"toggle\",\"pin\":%d}",
            first ? "" : ",", pins->led);
        first = false;
    }
    if (flash_enabled()) {
        o += snprintf(s_buf + o, FW_INFO_BUF_SIZE - o,
            "%s{\"name\":\"flash\",\"type\":\"level\",\"range\":[0,100],\"pin\":%d}",
            first ? "" : ",", pins->flash);
        first = false;
    }
    // WiFi has no pin config and stays unconditional.
    o += snprintf(s_buf + o, FW_INFO_BUF_SIZE - o,
        "%s{\"name\":\"wifi\",\"type\":\"wifi-scan\"}", first ? "" : ",");
    first = false;

    // Ops: structured command channel (JSON over BLE write). Dashboard
    // dispatches verbs through this — currently motors-pulse-raw and
    // motors-set-orientation for the calibration wizard. fw_info.caps
    // entry makes the OPS_CHAR_UUID resolvable as entry.opsChar on the
    // dashboard side.
    o += snprintf(s_buf + o, FW_INFO_BUF_SIZE - o,
        ",{\"name\":\"ops\",\"type\":\"command\"}");

    // File service — only when the `storage` partition mounted (fs_svc's
    // boot probe). A unit app-only-OTA'd onto an old partition table omits
    // this cap, and the dashboard's IDE view falls back to local drafts.
    if (fs_svc_available()) {
        o += snprintf(s_buf + o, FW_INFO_BUF_SIZE - o,
            ",{\"name\":\"fs\",\"type\":\"file-service\"}");
    }

    // On-robot Python VM — only where it came up (PSRAM boards). The IDE's
    // "Run on robot" appears against this cap.
    if (pyvm_available()) {
        o += snprintf(s_buf + o, FW_INFO_BUF_SIZE - o,
            ",{\"name\":\"python\",\"type\":\"script-vm\"}");
    }

    if (motors_enabled()) {
        // Schema matches gpiozero Motor() on the Pi side — `enable` is
        // optional and only present when wired. When omitted the chip is
        // running in PWM-on-direction mode (ENA/ENB tied HIGH externally,
        // factory jumpers on the L298N). Present means PWM-on-enable
        // mode with the chip driving speed via the enable line.
        o += snprintf(s_buf + o, FW_INFO_BUF_SIZE - o,
            ",{\"name\":\"motors\",\"type\":\"signed-pair\",\"range\":[-100,100],"
            "\"pins\":{\"left\":{\"forward\":%d,\"backward\":%d",
            pins->motor_l_fwd, pins->motor_l_bwd);
        if (pins->motor_ena >= 0)
            o += snprintf(s_buf + o, FW_INFO_BUF_SIZE - o, ",\"enable\":%d", pins->motor_ena);
        o += snprintf(s_buf + o, FW_INFO_BUF_SIZE - o,
            "},\"right\":{\"forward\":%d,\"backward\":%d",
            pins->motor_r_fwd, pins->motor_r_bwd);
        if (pins->motor_enb >= 0)
            o += snprintf(s_buf + o, FW_INFO_BUF_SIZE - o, ",\"enable\":%d", pins->motor_enb);
        o += snprintf(s_buf + o, FW_INFO_BUF_SIZE - o, "}}}");
    }
    // tick-count cap has no dashboard runtime (yet) — RUNTIMES[type]
    // falls through to no-op; claimsFromEntry still picks up `pins` for
    // the pinout view. Ticks reach the dashboard via telemetry.
    if (rgb_enabled()) {
        // Common-cathode RGB triple (e.g. Yahboom BST-03 headlights). New
        // "rgb" runtime renders a native color picker; 3-byte BLE writes.
        o += snprintf(s_buf + o, FW_INFO_BUF_SIZE - o,
            ",{\"name\":\"rgb\",\"type\":\"rgb\",\"pins\":{\"r\":%d,\"g\":%d,\"b\":%d}}",
            pins->rgb_r, pins->rgb_g, pins->rgb_b);
    } else if (ws2812_enabled()) {
        // Onboard single-wire addressable RGB (S3-CAM, GPIO48). Same "rgb"
        // color-picker cap + RGB char — one data pin instead of three. The
        // gatt rgb write path fans out to the WS2812 driver.
        o += snprintf(s_buf + o, FW_INFO_BUF_SIZE - o,
            ",{\"name\":\"rgb\",\"type\":\"rgb\",\"pin\":%d}", pins->ws2812);
    }
    if (servo_enabled()) {
        // SG90-class hobby servo. Reuses the level runtime (slider 0..180);
        // firmware applies as 500–2500µs pulse-width at 50Hz.
        // unit "\u00b0" (°) so the slider card reads "90°" instead of "90%".
        o += snprintf(s_buf + o, FW_INFO_BUF_SIZE - o,
            ",{\"name\":\"servo\",\"type\":\"level\",\"range\":[0,180],\"unit\":\"\\u00b0\",\"pin\":%d}",
            pins->servo);
    }
    if (encoders_enabled()) {
        o += snprintf(s_buf + o, FW_INFO_BUF_SIZE - o,
            ",{\"name\":\"encoders\",\"type\":\"tick-count\","
            "\"pins\":{\"left\":%d,\"right\":%d}}",
            pins->enc_l, pins->enc_r);
    }
    if (camera_present()) {
        o += snprintf(s_buf + o, FW_INFO_BUF_SIZE - o,
            ",{\"name\":\"camera\",\"type\":\"mjpeg-stream\"}");
        // Snapshot is BLE-only and works without WiFi — distinct cap so the
        // dashboard renders it independently of the live-stream card.
        o += snprintf(s_buf + o, FW_INFO_BUF_SIZE - o,
            ",{\"name\":\"snapshot\",\"type\":\"ble-snapshot\"}");
    }
    o += snprintf(s_buf + o, FW_INFO_BUF_SIZE - o, "]");
    // Small static field for the Monitor view's System table. (Big/dynamic
    // fields belong in telemetry — keep fw_info's single BLE read lean.)
    o += snprintf(s_buf + o, FW_INFO_BUF_SIZE - o, ",\"idf\":\"%s\"", esp_get_idf_version());
    if (!camera_present() && camera_init_error() != 0) {
        o += snprintf(s_buf + o, FW_INFO_BUF_SIZE - o,
            ",\"camera_err\":%d", camera_init_error());
    }
    snprintf(s_buf + o, FW_INFO_BUF_SIZE - o, "}");
    ESP_LOGI(TAG, "%s", s_buf);
}

const char *fw_info_json(void) { return s_buf; }
